In [6]:
myfood = ['banana', 'apple', 'candy']
myhobby = ['exercise','movie','book','game']

In [2]:
print(myfood[0])
print(myfood[1])
print(myfood[2])

banana
apple
candy

In [3]:
print(myfood[1:3])

['apple', 'candy']

In [4]:
for item in myfood:
    print(item)

banana
apple
candy

In [7]:
for item in myhobby:
    print(item)

exercise
movie
book
game

In [5]:
a = []

while 1:
    b = input("당신의 취미를 입력 : ")
    if b=='끝':
        break
    a.append(b)
print()
print("당신의 취미는 : ", end="")
for item in a:
    print(item, end=" ")

당신의 취미를 입력 : d
당신의 취미를 입력 : a
당신의 취미를 입력 : z
당신의 취미를 입력 : 끝

당신의 취미는 : d a z

In [6]:
dict1 = {'one':'하나', 'two':"둘", 'three':'셋'}
dict2 = {1:"하나", 2:"둘", 3:"셋"}
dict3 = {'col1':[1,2,3], 'col2':['a','b','c']}

In [7]:

print(dict1)
print(dict2)
print(dict3)

{'one': '하나', 'two': '둘', 'three': '셋'}
{1: '하나', 2: '둘', 3: '셋'}
{'col1': [1, 2, 3], 'col2': ['a', 'b', 'c']}

In [8]:
import pandas as pd 
from pandas import Series, DataFrame

In [9]:
print("pandas 버전 : ", pd.__version__) # 23번개정판에  버그 4번고침?

pandas 버전 :  0.23.4

In [10]:
score = Series( [1000,14000, 3000, 3000, 1000] )
print(score)

0     1000
1    14000
2     3000
3     3000
4     1000
dtype: int64

In [11]:
print("자료형 확인 : ", type(score))

자료형 확인 :  <class 'pandas.core.series.Series'>

In [12]:
print(score.index)

RangeIndex(start=0, stop=5, step=1)

In [13]:
score = Series( [1000, 14000, 3000], 
                index=['2019-05-01', '2019-05-02', '2019-05-03'])
print(score)

2019-05-01     1000
2019-05-02    14000
2019-05-03     3000
dtype: int64

In [14]:
gildong = Series([1500, 3000, 2500],
   index = ['2019-05-01', '2019-05-02', '2019-05-03'] )
toto = Series([3000, 3000, 2000],
   index = ['2019-05-01', '2019-05-03', '2019-05-02'] )

In [19]:
i=0
a=0
for value in gildong.values:
    if value >= 2500:
        i +=1
print("gildong에서 2500 이상 : " , i)
for value in toto.values:
    if value >= 2500:
        a +=1
print("toto에서 2500이상 : ", a)

gildong에서 2500 이상 :  2
toto에서 2500이상 :  2

In [21]:
dat = { 'col1' : [1,2,3,4],
        'col2' : [10,20,30,40],
        'col3' : ['A', 'B', 'C', 'D'] }
df = DataFrame(dat)
df

   col1  col2 col3
0     1    10    A
1     2    20    B
2     3    30    C
3     4    40    D

In [22]:
team_score = {  "toto":[1500,3000,5000,7000,5500],
                "apple":[4000,5000,6000,5500,4500],
                "gildong":[2000,2500,3000,4000,3000],
                "catanddog":[7000,5000,3000,5000,4000]}
team_df = DataFrame(team_score)
team_df

   toto  apple  gildong  catanddog
0  1500   4000     2000       7000
1  3000   5000     2500       5000
2  5000   6000     3000       3000
3  7000   5500     4000       5000
4  5500   4500     3000       4000

In [26]:
date = ['19-05-01','19-05-02', '19-05-03', '19-05-04', '19-05-05']
team_df = DataFrame(team_score,
    columns=['catanddog', 'toto', 'apple', 'gildong'],
    index=date)
team_df

          catanddog  toto  apple  gildong
19-05-01       7000  1500   4000     2000
19-05-02       5000  3000   5000     2500
19-05-03       3000  5000   6000     3000
19-05-04       5000  7000   5500     4000
19-05-05       4000  5500   4500     3000